{"format":"layers-model","generatedBy":"keras v3.13.2","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.13.2","backend":"tensorflow","model_config":{"class_name":"Sequential","config":{"name":"sequential_5","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"layers":[{"class_name":"InputLayer","config":{"batchInputShape":[null,14,4],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer_5","optional":false}},{"class_name":"Bidirectional","config":{"name":"bidirectional_5","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"merge_mode":"concat","layer":{"module":"keras.layers","class_name":"LSTM","config":{"name":"forward_lstm_5","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":false,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"seed":null},"registered_name":null,"build_config":{"input_shape":[null,14,4]}},"backward_layer":{"module":"keras.layers","class_name":"LSTM","config":{"name":"backward_lstm_5","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"return_sequences":false,"return_state":false,"go_backwards":true,"stateful":false,"unroll":false,"zero_output_for_mask":false,"units":64,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"seed":null},"registered_name":null,"build_config":{"input_shape":[null,14,4]}}}},{"class_name":"Dropout","config":{"name":"dropout_5","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.1,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_10","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null}},{"class_name":"Dense","config":{"name":"dense_11","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":7,"activation":"linear","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null}}],"build_input_shape":[null,14,4]}},"training_config":{"loss":{"class_name":"Huber","config":{"name":"huber_loss","reduction":"sum_over_batch_size"}},"loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":0.000015625000742147677,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-7,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"bidirectional_5/forward_lstm_5/kernel","shape":[4,256],"dtype":"float32"},{"name":"bidirectional_5/forward_lstm_5/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_5/forward_lstm_5/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_5/backward_lstm_5/kernel","shape":[4,256],"dtype":"float32"},{"name":"bidirectional_5/backward_lstm_5/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_5/backward_lstm_5/bias","shape":[256],"dtype":"float32"},{"name":"dense_10/kernel","shape":[128,32],"dtype":"float32"},{"name":"dense_10/bias","shape":[32],"dtype":"float32"},{"name":"dense_11/kernel","shape":[32,7],"dtype":"float32"},{"name":"dense_11/bias","shape":[7],"dtype":"float32"}]}]}